---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.ClipPlane.Normal
source: html/b370f0d0-2302-9f26-8dd3-7b0f13f8757b.htm
---
# Autodesk.Revit.DB.DirectContext3D.ClipPlane.Normal Property

The plane's normal vector.

## Syntax (C#)
```csharp
public XYZ Normal { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null